/* 
  Localizable.strings (English)
  AMD Power Gadget
*/

/* NOTE: Some keys use Spanish text for historical reasons. */
/* These are used as lookup identifiers and work correctly. */
/* A future refactor should standardize all keys to English. */

"Dashboard" = "Приладна дошка";
"Telemetry" = "Телеметрія";
"Fan Control" = "Fan контроль";
"Profiles" = "Profiles";
"Advanced" = "Додатково";
"Menu Bar" = "Смужка меню";
"System Info" = "Системна інформація";
"Desktop Widgets" = "Віджети робочого столу";

"AMD Power" = "Сила AMD";
"Gadget" = "Gadget";

"CPU" = "ЦП";
"GPU" = "Геконка";
"Freq" = "Фрек";
"Average" = "Середнє значення";
"Avg: %@" = "Середа: %@";
"Collecting data…" = "Collecting data…";

"Low Power Mode (LPM)" = "Режим економії енергії (PM)";
"Allows macOS to auto-manage CPU frequency" = "Дозволяє macOS автоматично керувати частотою ЦП";
"Forces CPU to lowest frequency for minimum power" = "Змушує частоту процесора бути найнижчою за мінімальну потужність";
"Core Performance Boost (CPB)" = "Підвищення продуктивності ядра (CPB)";
"Update Interval" = "Інтервал оновлення";
"Adjust how frequently telemetry data updates. Lower = more responsive, higher = less CPU usage." = "Налаштуйте частоту оновлення даних телеметрії. Нижче = додатково = додаткове навантаження на ЦП.";

"Opciones en Menú Bar" = "Параметри рядка меню";
"Choose which items appear in the menu bar. Changes apply immediately." = "Виберіть елементи, які з’являться в рядку меню. Зміни застосовуються негайно.";
"Customize the visual appearance of the menu bar items." = "Налаштуйте зовнішній вигляд елементів панелі меню.";
"Límite de Temp de Alerta" = "Обмеження сповіщень";
"Color de Alerta de Temp" = "Колір оповіщення";
"Color de Flechas" = "Колір стрілок";
"Additional telemetry for the menu bar." = "Додаткова телеметрія для панелі меню.";
"GPU data is shown inside Temp, Power, Memory and Fan columns when enabled." = "Дані GPU відображаються всередині Temp, Power, Memory і Fan, коли увімкнено.";
"Show GPU VRAM" = "Показати GPU VRAM";
"G:X.XG in Memory column" = "G:X.XG в стовпці пам'яті";
"Show GPU Fan Speed" = "Показати швидкість GPU Fan";
"G:XXXX in Fan column" = "G:XXXX у колонці Fan";

"No fans detected." = "Не виявлено фанів.";
"SMC driver not available" = "SMC драйвер не доступний";
"Your SMC chip may not be supported." = "Ваш SMC чіп не підтримується.";
"RPM" = "RPM";
"Throttle" = "Дросель";
"↩ Reset to Auto" = "↩️ Скинути до Авто";

"Select a profile to adjust the CPU operating range. Changes take effect immediately." = "Виберіть профіль для налаштування діапазону операцій процесора. Зміни набувають чинності негайно.";

"Directly edit raw P-State registers. Requires kext privilege check disabled via boot-arg or root." = "Безпосередньо редагувати регістри P-стану. Для перевірки необхідно мати права на kext вимкнено через boot-arg або root.";
"This will write the raw P-State definitions directly to the CPU. Proceed?" = "Будуть показані визначення, виконані безпосередньо процесором. Продовжити?";
"Disabled — work in progress" = "Вимкнені - робота в процесі";
"WIP" = "В розробці";

"Enable in OC: Misc → Security → ExposeSensitiveData = 0x08" = "Увімкнути в OC: Різні → Безпека → ExposeSensitiveData = 0x08";
"Motherboard info not available" = "Інформація щодо порталу не доступна";

"Vista previa de la Barra de Menús:" = "Попередній перегляд рядка меню:";
"Ancho estimado: %dpt" = "Estimated Width: %dpt";
"Restart the app to fully apply width changes." = "Перезапустіть додаток, щоб повністю застосувати зміни ширини.";
"Small (%dpt)" = "Малий (%dpt)";
"Medium (%dpt)" = "Середній (%dpt)";
"Large (%dpt)" = "Великий (%dpt)";

"Green" = "Зелений";
"Blue" = "Синій";
"Orange" = "Помаранчевий";
"Red" = "Червоний";
"Purple" = "Пурпурний";
"Pink" = "Рожевий";
"Teal" = "Зелено-блакитний";
"Turquoise" = "Turquoise";

"Verde" = "Зелений";
"Azul" = "Синій";
"Naranja" = "Помаранчевий";
"Rojo" = "Червоний";
"Morado" = "Пурпурний";
"Rosa" = "Рожевий";
"Turquesa" = "Зелено-блакитний";

"Dynamic Colors (Temp Only)" = "Динамічні кольори (лише тимчасово)";
"Temp Alert Color" = "Колір для тимчасових сповіщень";
"Temp Alert Limit" = "Обмежити температуру оповіщення";
"Network" = "Мережа";
"Network Arrows Color" = "Колір стрілок мережі";
"Exit" = "Вийти";
"AMD Power Gadget" = "AMD потужний ґаджет";
"AMD Power Tool" = "Інструмент потужності AMD";
"SMC Fans" = "Фанс SMC";

"Fan 1" = "Віяло 1";
"Fan 2" = "Фан 2";
"Fan 3" = "Фан 3";
"Fan 4" = "Фан-4";
"Fan 5" = "Фан 5";
"Fan 6" = "Фан 6";
"Fan 7" = "Фан-7";
"Fan 8" = "Фан-8";

/* Alerts */
"To enable motherboard display:" = "Щоб увімкнути відображення материка:";
"Open your OpenCore config file,\n\nGo to Misc -> Security -> ExposeSensitiveData,\n\nSet the value to 0x08 to expose board information." = "Відкрийте файл конфігурації OpenCore,\n\nПерейдіть на інший файл безпеки -> Безпека -> ExposeSensitiveData,\n\nВстановіть значення в 0x08 для відображення інформації про дошки.";
"Done" = "Виконано";
"Invalid Input" = "Invalid Input";
"Please type in numbers in hexadecimal." = "Будь ласка, введіть цифри у шістнадцятковому.";
"Unable to Set PStateDef" = "Не вдалося встановити PStateDef";
"Action was denied as current user does not have enough privilege,\nor was canceled by current user.\n\nRun AMD Power Gadget as root user or disable privilege check with boot-arg '-amdpnopchk'\n\nOtherwise, click 'Once' in the warning message to allow this change." = "Action was denied as current user does not have enough privilege,\nor was canceled by current user.\n\nRun AMD Power Gadget as root user or disable privilege check with boot-arg '-amdpnopchk'\n\nOtherwise, click 'Once' in the warning message to allow this change.";
"Your changes will not be saved" = "Ваші зміни не буде збережено";
"Click apply to save changes before closing this windows." = "Натисніть застосовувати, щоб зберегти зміни перед закриттям цього вікна.";
"Cancel" = "Скасувати";
"Close without saving" = "Закрити без збереження";
"Invalid File" = "Неприпустимий файл";
"The selected file could not be read or is not a valid pstate file." = "Вибраний файл не може бути прочитаний або некоректний файл pдержав.";
"OK" = "Гаразд";

/* Dynamic format strings */
"Avg: %.2f GHz, Max: %.2f GHz" = "Середа: %.2f GHz, Max: %.2f GHz";
"%.2f °C" = "%.2f °C";
"%.2f Watt" = "%.2f W";

/* Session Peaks */
"Session Peaks" = "Версії сеансу";
"Reset Peaks" = "Скинути піки";

/* GPU Fan Control */
"GPU Fan Control (Zero RPM / Curves)" = "Керування Fan GPU (нуль RPM / Curvs)";
"macOS Hardware Limitation" = "macOS апаратне обмеження";
"Direct software-based GPU fan speed overrides (such as zero-rpm toggle or drawing fan curves in macOS) are not supported by the macOS kernel/IOKit driver for AMD GPUs. The GPU's onboard firmware (vBIOS) manages the fans." = "Прямі перевизначення швидкості фанів на основі графічного процесора (наприклад, перемикач «нульового rpm» або створення кривих фанів у macOS) не підтримуються рухом macOS kernel/IOKit для AMD GPU. Вбудована прошивка GPU управління процесором (vBIOS) керує фанами.";
"Standard Hackintosh Solution:" = "Стандартне рішення щодо Hackintosh :";
"The only way to modify this behavior (like forcing fans to spin at lower temperatures or disabling Zero RPM) is by exporting the vBIOS, creating a Soft PowerPlay Table (SPPT), and injecting it via OpenCore's config.plist under DeviceProperties." = "Єдиний спосіб змінити цю поведінку (наприклад, примушуючи шанувальників обертатися при нижчій температурі чи відключенні нульового RPM) експортуючи vBIOS, створення таблиці Soft PowerPlay (SPPT) і введення його через конфігурацію OpenCore. список в розділі Властивості пристроїв.";
"Open SPPT Guide" = "Відкрити SPPT керівництво";
"MorePowerTool" = "Більші інструменти";

/* CPPC & EPP */
"Native CPPC Active Mode (EPP)" = "Нативний CPPC активний (EPP)";
"Enables autonomous hardware frequency scaling (recommended)" = "Вмикає автономне апаратне масштабування частоти (рекомендовано)";
"Power Management Mode" = "Режим керування потужністю";
"Energy Preference (EPP)" = "Енергетичні налаштування (EPP)";
"Select a hardware autonomous profile. The CPU will scale frequency dynamically." = "Вибір апаратного автономного профілю. ЦП буде динамічно масштабувати частоту.";
"Performance" = "Продуктивність";
"Balanced Perf" = "Збалансована перевага";
"Balanced Power" = "Збалансована сила";
"Power Save" = "Енергозбереження";
"Active Profile Status" = "Стан активного профілю";
"CPU Speed Profiles (Legacy)" = "Профілі швидкості процесора (застарілі)";
"Select a manual P-State override profile. Frequencies will be restricted to the selected step." = "Вибір ручного профілю запису P-State після цього налаштування частоти будуть обмежені даними з вибраного кроку.";
"Mode" = "Режим";
"EPP Profile" = "EPP профіль";

/* Desktop Widgets */
"Show CPU Widget" = "Показати віджет процесора";
"Show GPU Widget" = "Показати віджет GPU";
"Show RAM Widget" = "Show RAM Widget";
"Show Disk Widget" = "Показати віджет диску";
"Show Network Widget" = "Показати віджет мережі";
"Show Fan Widget" = "Показати Візуальний віджет";
"Disable All Widgets" = "Вимкнути всі віджети";
"Sort by Rank" = "Впорядкувати за званням";
"Edit Widget Layout" = "Редагувати макет віджета";
"Unlock widgets to drag them around the screen" = "Розблокуйте віджети, щоб перетягувати їх навколо екрану";
"Widget Options" = "Параметри віджета";
"Customize the appearance and behavior of your desktop widgets." = "Налаштуйте зовнішній вигляд та поведінку віджетів вашого робочого столу.";
"Auto-Align Active Widgets" = "Автоматичне вирівнювання активних віджетів";
"Automatically stack active widgets at a corner" = "Автоматично ставляти активні віджети в кутку";
"Alignment Corner" = "Кут вирівнювання";
"Top Right" = "Верхній правий кут";
"Top Left" = "Зліва зверху";
"Bottom Right" = "Знизу праворуч";
"Bottom Left" = "Нижній лівий";
"Show Clock Widget" = "Показати віджет годинника";
"Clock" = "Годинник";
"Stats Table" = "Статистичний стіл";
"Classic Glass" = "Класичний скло";
"Pro Monitor" = "Pro Monitor";
"Core Matrix" = "Основна матриця";

"United" = "Юнайтед";
"Show United Widget" = "Показати об'єднаний віджет";
"Configure Combined Metrics" = "Налаштувати комбіновану метрику";
"Include CPU" = "Включити ЦП";
"Include GPU" = "Включити GPU";
"Include RAM" = "Включати оперативну пам'ять";
"Include Disk" = "Включити диск";
"Include Network" = "Включаючи мережу";
"Include Fan" = "Включити Віяло";

"Temas & Apariencia" = "Теми і вигляд";
"Análisis" = "Аналіз";

"Select Visual Theme (Instant Application)" = "Вибрати візуальну тему (миттєві програми)";
"Custom Theme Creator & Exchange (JSON)" = "Спеціальний творець тем та біржа (JSON)";
"Chart Rendering Style" = "Стиль рендерингу графіка";
"Custom Theme Editor" = "Редактор тем";
"Showing active theme colors. Adjust any color to customize." = "Відображення активних кольорів теми. Налаштуйте будь-який колір для налаштування.";
"Use the Opacity slider for transparency (macOS color panel alone often resets alpha)." = "Використовуйте повзунок непрозорості для прозорості (тільки для панелі кольору macOS часто скидає альфа).";
"Opacity" = "Непрозорість";
"Edit Active Theme" = "Редагувати активну тему";
"Export Theme (JSON)" = "Експортувати тему (JSON)";
"Import Theme (JSON)" = "Імпортувати тему (JSON)";
"Card Background" = "Тло картки";
"Cyan Accent" = "Бірюзовий акцент";
"Orange Accent" = "Помаранчевий акцент";
"Green Accent" = "Зелений відтінок";
"Purple Accent" = "Бузковий акцент";

/* ===== Auto-extracted / curated for Crowdin (v3.16.1+) ===== */
"%.0f" = "%.0f";
"%.0f K/s" = "%.0f K/s";
"%.0f MHz" = "%.0f МГц";
"%.0f%%" = "%.0f%%";
"%.0fG" = "%.0fG";
"%.0f°" = "%.0f°";
"%.0f°C" = "%.0f°C";
"%.0f°C • %.0fW" = "%.0f°C • %.0fW";
"%.1f %@" = "%.1f %@";
"%.1f Ghz" = "%.1f Ghz";
"%.1f M/s" = "%.1f M/s";
"%.1f s" = "%.1f s";
"%.1f%%" = "%.1f%%";
"%.1f°C" = "%.1f°C";
"%.2f GHz" = "%.2f GHz";
"%.3f V" = "%.3f V";
"%.4f V" = "%.4f V";
"100°C" = "100°C";
"1h" = "1 год";
"24h" = "24 год";
"30d" = "30д";
"60°C" = "60 ° C";
"7d" = "7 днів";
"Accept & Continue" = "Прийняти та продовжити";
"Active" = "Активний";
"All Auto" = "Всі авто";
"All Combined" = "Всі об'єднані";
"All Fans Auto" = "Всі фанати авто";
"AMD CPU Cores" = "Ядра ЦП AMD";
"AMD Power Gadget recolecta datos automáticamente cada minuto." = "AMD Power Gadget recolecta datos automáticamente cada minuto.";
"AMD Processor Power Manager (PPM)" = "Менеджер потужностей AMD Processor (PPM)";
"Analysis" = "Аналіз";
"Apply" = "Прийняти";
"Apply P-States?" = "Застосувати P-налаштування?";
"Arrange the order in which resource widgets appear. Click arrows to swap position." = "Впорядкуйте порядок, в якому з'являються віджети ресурсів. Натисніть стрілки, щоб змінити позицію.";
"Arrow Color" = "Колір стріл";
"Automatically switches EPP profiles based on live CPU load" = "Автоматично перемикає профілі EPP на основі живого процесора";
"Average core frequency in GHz" = "Середня основна частота в ГГц";
"Average utilization over time" = "Середнє завантаження з часом";
"Avg Frequency" = "Середня частота";
"Avg." = "Сер.";
"Avg: %.0f%%" = "Середнє: %.0f%%";
"Balanced\n%.1f GHz" = "Balanced\n%.1f GHz";
"Base\n%.1f GHz" = "Base\n%.1f GHz";
"BIOS / Auto" = "BIOS / Авто";
"Buscando actualizaciones..." = "Buscando actualizaciones...";
"Bytes (Read)" = "Байт (читання)";
"Bytes (Write)" = "Байт (запис)";
"Cargando tendencias de telemetría..." = "Cargando tendencias de telemetría...";
"Chart Metric" = "Метрика графіка";
"Chart Type" = "Тип Графіку";
"Charts require macOS 13+" = "Діаграми потребують macOS 13+";
"Charts require macOS 13.0+" = "Діаграми потребують macOS 13.0+";
"Check for new releases of SMCAMDProcessor and AMD Power Gadget on GitHub." = "Перевіряйте нові релізи SMCAMDProcessor та AMD Power Gadget на GitHub.";
"Check for Updates" = "Перевірити наявність оновлень";
"Check Now" = "Перевірити зараз";
"Circular Ring" = "Кільце";
"Column Bars" = "Смуги стовпців";
"Configure Charts" = "Налаштування діаграм";
"Configure labels and layout details for widgets inside the popover." = "Налаштуйте мітки та відображення віджетів всередині спливаючого вікна.";
"Connection Error: %@" = "Помилка з'єднання: %@";
"Continuous Background Logging" = "Безперервний журнал у фоновому режимі";
"Continuously write telemetry samples to a CSV file in the background" = "Постійно писати зразки телеметрії до CSV-файлу у фоновому режимі";
"Control Mode" = "Режим керування";
"Core Rankings (Estimated by Freq)" = "Основні рейтинги (оцінювані за Freq)";
"Could not fetch release info." = "Не вдалося отримати інформацію про реліз.";
"CPPC hardware rankings are active and loaded from the processor." = "CPPC апаратні градації активні та завантажені з процесора.";
"CPPC hardware values could not be read. Rankings are estimated from the maximum observed clock frequency of each core." = "Не вдалося прочитати значення CPPC обладнання. Орієнтовна частота годинника в кожному ядрі буде розрахована на максимальну частоту.";
"CPPC Preferred Cores (Silicon Quality)" = "Бажані ядра процесору (якість кремнію)";
"CPPC: Active" = "CPPC: HW OK";
"CPPC: Estimated" = "КПК: Орієнтовна";
"CPU and GPU temperatures" = "Температура процесора та графічного процесора";
"CPU Average Frequency" = "Середня частота процесора";
"CPU Freq Avg (GHz)" = "Налаштування частоти процесора (GHz)";
"CPU Frequency" = "Частота процесора";
"CPU Load" = "Завантаження процесора";
"CPU Load (%)" = "Навантаження на процесор (%)";
"CPU Package Power" = "Потужність пакунка ЦП";
"CPU Per-Core Thread Load" = "Завантаження ядер процесора";
"CPU Power" = "Потужність процесора";
"CPU Power (W)" = "Живлення процесора (W)";
"CPU Power Alert" = "Сигнал живлення процесора";
"CPU power has been at %.1fW (above limit of %dW) for over %d seconds!" = "Потужність процесора була в %.1fW (вище ліміту %dW) протягом більш ніж %d секунд!";
"CPU Temp" = "Темп процесора";
"CPU Temp (°C)" = "Температура процесора (°C)";
"CPU Temperature" = "Температура процесора";
"CPU Temperature Alert" = "Оповіщення про температуру ЦП";
"CPU temperature has reached %.1f°C!" = "CPU temperature has reached %.1f°C!";
"CPU Tracker" = "Відслідковування ЦП";
"Current version: v%@\nNew version: %@\n\nRelease Notes:\n%@" = "Поточна версія: v%@\nНова версія: %@\n\nПримітки до випуску:\n%@";
"Curve" = "Крива";
"Curve Optimizer is only active when the AMDRyzenCPUPowerManagement kext supports Zen 3 SMU mailbox interface." = "Curve оптимізатор активний лише тоді, коли AMDRyzenCPUPowerManagement kext підтримує інтерфейс поштової скриньки Zen 3 SMU.";
"Custom" = "Користувацька";
"Customize the behavior and visibility of the menu bar popover." = "Налаштувати поведінку та видимість вікна панелі меню.";
"Cyberpunk Neon" = "Cyberpunk Neon";
"Delete Point" = "Видалити точку";
"Device Utilization %" = "Використання пристрою %";
"Disable heavy visual effects if your system lacks Metal graphics acceleration." = "Вимкніть потужні візуальні ефекти, якщо у вашій системі не вистачає прискорення графіки.";
"DISCLAIMER: This software interacts directly with low-level hardware control registers. By using it, you agree that absolute responsibility for any system instability, hardware damage, or alien invasion lies entirely with the user." = "DISCLAIMER: Це програмне забезпечення взаємодіє безпосередньо з реєстраціями апаратного забезпечення низького рівня. Використовуючи його, ви погоджуєтесь із тим, що абсолютна відповідальність за нестабільність системи, ушкодження обладнання чи за вторгненням, повністю покладається на користувача.";
"DISCLAIMER: This software interacts directly with low-level hardware control registers. By using it, you agree that absolute responsibility rests entirely with the user." = "DISCLAIMER: Це програмне забезпечення безпосередньо взаємодіє з регістрами контролю низького рівня. Використовуючи його, ви погоджуєтеся, що абсолютна відповідальність покладається повністю на користувача.";
"Disk" = "Диск";
"DISK" = "ВІДКРИТИ";
"Disk Activity" = "Активність диску";
"Disk Activity (MB/s)" = "Активність диску (МБ/с)";
"Disk Activity (Read+Write)" = "Активність диску (читання+запис)";
"Disk I/O" = "Диск вводу/виводу";
"Disk Tracker" = "Відслідковування диска";
"Do you want AMD Power Gadget to start in menu bar at login? \n\n This will only be asked once. You can change this setting later under Appearance menu." = "Бажаєте ввімкнути режим енергозбереження в меню після входу? \n\n Буде запропоновано тільки один раз. Ви можете змінити це налаштування пізніше в меню Вигляд.";
"Donate (PayPal)" = "Пожертвувати (PayPal)";
"Download" = "Звантажити";
"Download on GitHub" = "Завантажити на GitHub";
"Download Update" = "Завантажити оновлення";
"Drag control points to edit curve. Double-click empty space to add (max 8). Double-click a point or right-click to delete." = "Перетягніть контрольні точки для редагування криви. Двічі клацніть на пустий простір, щоб додати (максимум 8). Двічі клацніть на точку або правою кнопкою миші, щоб видалити.";
"Dynamic Auto-EPP Workload Engine" = "Динамічний АвтоEPP Workload Engine";
"Dynamic Next-Gen Fan Curves" = "Динамічні криві Next-Gen Fan";
"Edit Layout" = "Редагувати макет сторінки";
"Efficient\n%.1f GHz" = "Efficient\n%.1f GHz";
"Enable additional stats columns inside the popover." = "Увімкнути додаткові стовпці статистики всередині спливаючого вікна.";
"Enable System Alerts" = "Увімкнути системні оповіщення";
"Error reading CPU data." = "Помилка читання даних процесора.";
"Evaluated in the kernel with 256-step LUT interpolation, hysteresis, and smooth ramping." = "Оцінений в ядрі через 256-кроковий інтерполяцію LUT, гістерезис та гладке демпінгу.";
"Export" = "Експорт";
"Export CSV" = "Експортувати в CSV";
"Export Telemetry History" = "Експортувати історію телеметрії";
"Export the history of samples currently in memory to a CSV file" = "Експортувати історію зразків, які зараз в пам'яті в CSV файл";
"Failed — check kext privileges (-amdpnopchk)." = "Не вдалося - перевірте привілеї kext (-amdpnopchk).";
"Fan" = "Віяло";
"Fan Number" = "Номер вентилятора";
"Fan Speed" = "Віялова швидкість";
"Fan Speed (RPM)" = "Художня швидкість (RPM)";
"Fan Speed(RPM)" = "Fan Speed(RPM)";
"Filled Area" = "Заповнена область";
"Freq:" = "Частота:";
"Frequency" = "Частота";
"Frequency Max:" = "Максимальний частота:";
"GHz" = "ГГц";
"GitHub Repository" = "GitHub Repository";
"GitHub Repository\n\nSpecial thanks to the AMD OS X community!\n\nCopyright © 2020-2026 Droga. All rights reserved." = "GitHub Repository\n\nSpecial thanks to the AMD OS X community!\n\nCopyright © 2020-2026 Droga. All rights reserved.";
"GPU Load" = "Завантаження GPU";
"GPU Model" = "Модель GPU";
"GPU Power" = "GPU Потужність";
"GPU Power (W)" = "GPU Живлення (W)";
"GPU Temp" = "Графічний інтерфейс GPU";
"GPU Temp (°C)" = "GPU температура (°C)";
"GPU Temperature" = "Температура GPU";
"GPU Tracker" = "GPU трекер";
"H.264 & HEVC Active" = "H.264 і HEVC активовано";
"H.264 Active (HEVC Inactive)" = "H.264 Активний (HEVC Неактивний)";
"HEVC Active (H.264 Inactive)" = "HEVC активний (H.264 Неактивний)";
"Hide this fan" = "Сховати цей фанат";
"High Load Threshold (Performance)" = "Поріг високого завантаження (виконання)";
"Histograma de Barras" = "Гістограма-де-Баррас";
"Hysteresis" = "Hysteresis";
"I accept that absolute responsibility lies entirely with the user." = "Я погоджуюсь, що абсолютна відповідальність покладається на користувача.";
"Idle Threshold (Power Save)" = "Поріг очікування (енергозбереження)";
"Import" = "Імпорт";
"Inactive" = "Неактивний";
"Inactive / Not Supported" = "Неактивний / Не підтримується";
"Index" = "Покажчик";
"Inject positive or negative voltage offsets per core. Center is 0 (no override). Limit: -30 (undervolt) to +30 (overvolt) counts." = "Впровадження позитивних або негативних напруг за ядро. Центр дорівнює 0 (без перевищення). Межа: -30 (undervolt) в +30 (overvolt) лічильники.";
"Inst(s) Retired:" = "Відповідно до інстанцій:";
"Kext Update Available" = "Kext доступний для оновлення";
"Later" = "Пізніше";
"Line Only" = "Тільки рядок";
"Load" = "Загрузити";
"Loading..." = "Завантажується...";
"Log File Location" = "Розташування файлу журналу";
"Logical Cores" = "Логічне ядро";
"Low Performance Mode" = "Режим низької продуктивності";
"Low Power\n%.1f GHz" = "Low Power\n%.1f GHz";
"Línea Escalonada (Step)" = "Лівенея Ескалонада (крок)";
"Línea Suave (Spline)" = "Лів'їзна суб (Spline)";
"Manual Override" = "Перевизначити вручну";
"Max Speed" = "Максимальна швидкість";
"Max." = "Макс.";
"MB/s" = "МБ/с";
"Memory Usage" = "Використання пам'яті";
"Menu Bar Preview:" = "Попередній перегляд рядка меню:";
"Mi Tema Custom" = "Mi Tema користувача";
"Min." = "Мін.";
"Monochrome Stealth" = "Монохромний Стілт";
"Máx." = "Ма́кс.";
"Máx:" = "Макс:";
"Mín." = "Май.";
"Mín:" = "Мітин:";
"N/A" = "Н/А";
"Net" = "Чистий";
"Net Download (MB/s)" = "Чисте завантаження (МБ/с)";
"Net Upload (MB/s)" = "Чисте завантаження (МБ/с)";
"Network Speed" = "Швидкість мережі";
"Network Throughput" = "Під час перевірки мережі";
"Network Total Speed" = "Загальна швидкість мережі";
"New version %@ available!" = "Нова версія %@ доступна!";
"New Version Available: %@" = "Доступна нова версія: %@";
"No" = "Ні";
"No AMDRyzenCPUPowerManagement Found!" = "Не знайдено керування AMDRyzenCPUPowerManag!";
"No curves configured." = "Не сконфігуровано жодних криз.";
"No hay suficientes datos recolectados aún." = "No hay suficientes datos recolectados aún.";
"No location selected" = "Не вибрано жодного розташування";
"No metrics active" = "Метрики відсутні";
"No release notes available." = "Немає доступних нотаток до випуску.";
"Nordic Frost" = "Північний Мороз";
"Not Supported" = "Не підтримується";
"Not supported by your CPU" = "Не підтримується вашим процесором";
"Not yet" = "Ще ні";
"Open Dashboard" = "Відкрити панель керування";
"Other Popover Widgets" = "Інші віджети Popover";
"P-State Editor" = "Редактор P-держав";
"P-States applied successfully." = "P-Штатів успішно застосовано.";
"P-States Configuration" = "Налаштування P-держав";
"Package" = "Пакет";
"Package Power" = "Потужність пакунку";
"Peak Fan" = "Пік Вентилятора";
"Peak Freq" = "Пік Фрек";
"Peak Power" = "Пік влада";
"Peak Temp" = "Піковий шаблон";
"Performance\n%.1f GHz" = "Продуктивність\n%.1f ГГц";
"Performance & Fallback" = "Продуктивність і відновлення";
"Personalizado" = "Personalizado";
"Physical Cores" = "Фізичні клопи";
"Pin Popover Open" = "Відкрити Pin Popover";
"Platform" = "Платформа";
"Please download AMDRyzenCPUPowerManagement from the release page." = "Будь ласка, завантажте AMDRyzenCPUPowerUManagement на сторінці релізу.";
"Popover Config" = "Popover Config";
"Popover General Settings" = "Зависання загальних параметрів";
"Popover Menu" = "Popover Menu";
"Power" = "Потужність";
"Power Warning Threshold (PPT)" = "Поріг індикатора Сили (ПП)";
"Prevent the popover from closing when clicking outside" = "Заборонити спливаюче вікно при натисканні на сторонній";
"Preview" = "Прев'ю";
"Processor" = "Процесор";
"Profile" = "Анкета";
"Progress Bar" = "Індикатор Прогресу";
"Prom." = "Пром.";
"PWR" = "ДВР";
"Quick Fan Access" = "Швидкий доступ";
"Quit" = "Вийти";
"Quit and Download" = "Вийти та завантажити";
"Radeon GPU" = "Radeon GPU";
"Radeon Graphics utilization percentage" = "Відсоток завантаження графіки Radeon";
"RAM" = "RAM";
"RAM Tracker" = "Трекер оперативної пам'яті";
"RAM Usage" = "RAM Usage";
"RAM Usage (%)" = "RAM Usage (%)";
"RAM Utilization" = "RAM Utilization";
"RAM utilization percentage" = "Відсоток завантаження оперативної пам'яті";
"Ramp Rate" = "Частота пульсації";
"Raw Register Details" = "Raw реєстраційні дані";
"Read Speed" = "Швидкість зчитування";
"Real-time energy consumption in Watts" = "Витрати енергії в реальному часі";
"Real-time History" = "Історія реального часу";
"Real-time upload / download speed (↑/↓)" = "У режимі реального часу вивантаження / завантаження (↑ /required! )";
"Receive native macOS alerts when the CPU exceeds configured thermal or power limits." = "Отримувати нативні повідомлення macOS, коли процесор перевищив налаштовані термозначні або потужності.";
"Refresh Rate" = "Частота оновлення";
"Relative Time (s)" = "Відносний час (ів)";
"Replaces translucent blurs with solid colors to save CPU" = "Замінює напівпрозорі розмивання суцільними кольорами для збереження процесора";
"Requests permission and enables hardware limit warnings" = "Запитує дозвіл і дає попередження про обмеження";
"Revert" = "Відмінити";
"Right-click any widget directly on your desktop to change its style dynamically (Classic Glass, Pro Monitor, or Core Matrix)." = "Клацніть правою кнопкою миші на будь-якому віджеті безпосередньо на комп'ютері, щоб змінити динамічну зміну стилю (Classic Glass, Pro Monitor, або Core Matrix).";
"SAFETY DISCLAIMER & LIABILITY AGREEMENT" = "РОЗДІЛЕННЯ ЗБІРКИ і УГОДА ПРО ПРО ЗАМОВЛЕННЯ";
"Seleccioná una gráfica en el panel superior para visualizar su histórico." = "Вибірка . Спробуйте зробити візуалізацію на Ел. панелі візуалізатор S.";
"Select File..." = "Обрати файл...";
"Select which metrics are shown and choose their visualization style." = "Виберіть показані метрики та виберіть стиль візуалізації.";
"Series" = "Серія";
"Show a floating, non-interactive widget on your desktop for live telemetry." = "Покажіть плаваючий, неінтерактивний віджет на робочому столі для телеметрії.";
"Show All (%d hidden)" = "Show All (%d hidden)";
"Show CPU" = "Показати ЦП";
"Show Fan RPM" = "Показувати RPM Fan";
"Show GPU Power" = "Показувати GPU силу";
"Show GPU Row" = "Показати GPU рядок";
"Show GPU Temp" = "Показувати температуру GPU";
"Show Memory" = "Показати пам'ять";
"Show Network" = "Показати мережу";
"Show Network Row" = "Показати рядок мережі";
"Show Network Speed Sparkline Graph below" = "Показати графік швидкості передачі мережі нижче";
"Show Per-Core Utilization Grid below" = "Показувати використання на Per-Core нижче";
"Show Power" = "Показати живлення";
"Show Ring Details" = "Показати подробиці Кільця";
"Show Ring Labels" = "Показати кільцеві мітки";
"Show Temperature" = "Показати температуру";
"Show Temperature Sparkline Graph below" = "Показати графік розсіювання лінії температури нижче";
"Show Top Processes" = "Показати ТОП процесів";
"Single large value instead of max/avg stack" = "Одне велике значення max/avg стек";
"SMC Fan Control" = "Керування SMC Fan";
"Smooth Curves" = "Гладкі криві";
"Software" = "Програмне забезпечення";
"Software Updates" = "Оновлення програм";
"Solarized Amber" = "Соляризований бурштин";
"Speed" = "Швидкість";
"SSD" = "ПдСх";
"Startup at login?" = "Запускати при вході?";
"Statistics" = "Статистика";
"Storage" = "Сховище";
"Style" = "Стиль";
"Style Options" = "Параметри стилю";
"Styles & Themes" = "Styles & Themes";
"Supported by your CPU" = "Підтримується вашим процесором";
"Sustained Duration" = "Тривалість стійкого терміну";
"Swap Total" = "Обміняти загальний";
"Swap Used" = "Обмін використано";
"System Alert Notifications" = "Сповіщення системи оповіщень";
"System Up to Date" = "Системне оновлення до дати";
"Tahoe Glass" = "Тахо Гласс";
"Temp" = "Темп";
"Temp Source" = "Джерело тимчасового коду";
"Temperature" = "Температура";
"Temperature Warning Threshold" = "Поріг попередження температури";
"Temperature(C)" = "Температура(C)";
"Temperatures" = "Температури";
"Themes & Appearance" = "Теми і вигляд";
"Thermal History" = "Теплова історія";
"This application can not be launched due to AMDRyzenCPUPowerManagement is reporting incorrect data." = "Цей додаток не може бути запущений через AMDRyzenCPUPowerManagement повідомляє про неправильні дані.";
"This software interacts directly with low-level CPU hardware registers, Model-Specific Registers (MSRs), and the System Management Unit (SMU) to control CPU voltages, frequencies, and power limits.\n\nIncorrect settings, unstable undervolting, or wrong configurations can cause system instability, data loss, kernel panics, or permanent hardware damage.\n\nBy continuing, you agree that absolute responsibility for any system instability, hardware damage, or alien invasion lies entirely with the user. The authors and contributors assume no liability whatsoever for any damage, loss, or side effects to your hardware, software, or personal property. Use at your own risk." = "Це програмне забезпечення безпосередньо взаємодіє з низькорівневими апаратними реєстраціями ЦП, Model-Specific Registers (MSRs), і підрозділ керування системою (SMU) для контролю напруг процесора, частот і обмежень потужності.\nНеправильні налаштування\nнестабільні налаштування або неправильні конфігурації можуть призвести до нестабільності системи втрати даних, панелі ядра або постійного апаратного пошкодження.\n\nПродовжуючи, ви погоджуєтеся з абсолютною відповідальністю за нестабільність системи, пошкодження обладнання або вторгнення чужинців. Автори та учасники припускають, що не несе ніякої відповідальності за будь-які збитки, втрати або побічні ефекти від обладнання, програмного забезпечення або особисту власність. Використовуйте на свій страх і ризик.";
"Thread %d: %.1f%%" = "%d: %.1f%%";
"Time" = "Час";
"Timeframe" = "Timeframe";
"Timestamp" = "Часові відмітки";
"TMP" = "ТАМп";
"Todas las gráficas están ocultas." = "Todas las gráficas están ocultas.";
"Top Processes" = "ТОП процесів";
"Total" = "Загальна сума замовлення";
"Total Power(W)" = "Всього енергії (W)";
"Tracks active memory usage and pressure." = "Відслідковує використання та тиск активної пам'яті.";
"Tracks CPU utilization average and core temperature." = "Відстежує середню та базову температуру ЦП.";
"Tracks graphics memory (VRAM) utilization." = "Допустиме завантаження графічної пам'яті (VRAM).";
"Tracks graphics utilization and temperature." = "Відбувається використання графіки та температури.";
"Tracks primary storage capacity usage." = "Відбувається використання первинного зберігання.";
"Unknown" = "Не вказано";
"Unknown GPU" = "Невідомий GPU";
"Unlock Curve Optimizer (DANGEROUS: unstable undervolting can cause kernel panic or instant reboot)" = "Розблокування оптимізатора кривої (DANGEROUS: нестійке розгортання може викликати паніку ядра або миттєве перезавантаження)";
"Unlock P-State Editor (DANGEROUS: incorrect settings can crash or damage hardware)" = "Розблокувати редактор нульової держави (DANGEROUS: неправильні параметри можуть зазнати пошкодження)";
"Upload" = "Вивантажити";
"Uptime" = "Час роботи";
"Use Popover Menu" = "Використовувати спливаюче меню";
"Used memory in GB" = "Використовується пам'ять в ГБ";
"Used RAM" = "Used RAM";
"UTC Time" = "Час UTC";
"V-F Operating Curve" = "V-F оперативна крива";
"Value" = "Цінність";
"VDA Decoder" = "Декодер VDA";
"Visible charts:" = "Видимі графіки:";
"Volt:" = "Volt:";
"VRAM" = "ПАМ'ЯТЬ";
"VRAM Tracker" = "Трекер VRAM";
"VRAM Used" = "Використання відеопам'яті";
"VRAM: %.2fG%@" = "РАМ: %.2fG%@";
"W" = "Пт";
"Weekday" = "Будній день";
"Widget Reordering" = "Змінення порядку віджетів";
"Widget Selection & Display Style" = "Вибір віджету і стиль відображення";
"Widget Style" = "Стиль віджета";
"Write Speed" = "Швидкість запису";
"Yes" = "Так";
"You are running the most recent version of AMD Power Gadget (v%@)." = "Ви використовуєте останню версію AMD Power Gadget (v%@).";
"You have the latest version installed (v%@)." = "У Вас встановлена остання версія (v%@).";
"°C" = "°C";
"Área Rellena (Gradient)" = "Área Rellena (градієнт)";

/* Compatibility / format keys */
"Your AMDRyzenCPUPowerManagement version (%@) is outdated and no longer API compatible. Please use version 3.0.0 or newer and start this application again." = "Ваша версія AMDRyzenCPUPowerManagement (%@) застаріла і більше не сумісна з API. Будь ласка, використовуйте версію 3.0.0 або новішу і знову запустіть цей додаток.";

/* App language picker */
"Language" = "Мова:";
"App Language" = "Мова програми";
"Choose the interface language. The app will restart to apply the change." = "Виберіть мову інтерфейсу. Додаток перезавантажиться для застосування змін.";
"System Default" = "Системна по замовчуванню";
"Current: %@" = "Current: %@";
"Restart required" = "Необхідне перезавантаження";
"Apply & Restart" = "Застосувати & Перезапустити";
"The app needs to restart to load the selected language." = "Додатку потрібно перезапустити програму, щоб завантажити вибрану мову.";

/* Privilege UX */
"This action requires administrator privileges. Run AMD Power Gadget as root, or add the boot argument -amdpnopchk for debugging." = "Ця дія потребує адміністративних привілеїв. Запустіть AMD Power Gadget в якості root, або додайте аргумент завантаження -amdpnopchk для налагодження.";

/* Crowdin: recent UI strings — CPPC badge vs EPP Active Mode */
"CPPC: HW OK" = "CPPC: HW OK";
"CPPC: EPP On" = "CPPC: EPP On";
"This CPU did not report CPPC support to the kext." = "This CPU did not report CPPC support to the kext.";
"If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). The green “CPPC: HW OK” badge only means rankings exist — it is not this switch." = "If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). The green “CPPC: HW OK” badge only means rankings exist — it is not this switch.";
"Native CPPC Active Mode (EPP) is ON. Cores scale autonomously; rankings come from the processor." = "Native CPPC Active Mode (EPP) is ON. Cores scale autonomously; rankings come from the processor.";
"CPPC hardware scores could not be read. Rankings are estimated from observed clocks. This is not the Profiles EPP toggle." = "CPPC hardware scores could not be read. Rankings are estimated from observed clocks. This is not the Profiles EPP toggle.";
"The CPU reports CPPC rankings (HW OK). That does not mean Active Mode is on — enable “Native CPPC Active Mode (EPP)” under Profiles (needs -amdpnopchk or root)." = "The CPU reports CPPC rankings (HW OK). That does not mean Active Mode is on — enable “Native CPPC Active Mode (EPP)” under Profiles (needs -amdpnopchk or root).";
/* Deprecated badge key — kept so old locales still resolve */
"CPPC: Active" = "CPPC: HW OK";

/* Menu Bar toggles (fabiosun IT) */
"Show Max Freq Only" = "Show Max Freq Only";

/* Menu Bar toggles (fabiosun IT) */
"Use Fahrenheit" = "Use Fahrenheit";

/* Menu Bar toggles (fabiosun IT) */
"Frequency column (max/avg GHz)" = "Frequency column (max/avg GHz)";

/* Menu Bar toggles (fabiosun IT) */
"CPU temp + optional GPU temp" = "CPU temp + optional GPU temp";

/* Menu Bar toggles (fabiosun IT) */
"Convert temperature values from Celsius to Fahrenheit" = "Convert temperature values from Celsius to Fahrenheit";

/* Menu Bar toggles (fabiosun IT) */
"CPU watts + optional GPU watts" = "CPU watts + optional GPU watts";

/* CPPC support gate */
"Active Mode and Auto-EPP stay off until the kext reports CPPC. Boot-arg -amdcppcactive alone is not enough if MSR/CPUID checks fail — reboot after updating kexts." = "Active Mode and Auto-EPP stay off until the kext reports CPPC. Boot-arg -amdcppcactive alone is not enough if MSR/CPUID checks fail — reboot after updating kexts.";
"AMDRyzenCPUPowerManagement kext not connected." = "AMDRyzenCPUPowerManagement kext not connected.";
"If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). With -amdcppcactive the kext enables Active Mode at boot after reboot." = "If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). With -amdcppcactive the kext enables Active Mode at boot after reboot.";
"Checking for updates..." = "Checking for updates...";
